<!-- часть2 -->
    <!-- http://igelpro.ru/KEW_kat.pdf -->
    <!-- <h2 >Основы технологии крепления</h2> -->
    <hr>                         
                            
    <h3><b>1.1 Бетон и стеновые кладочные материалы (полнотелые кирпичи)</b></h3>                         
    <h3>1.1.1 Бетон </h3> 
    <p>
        Бетон представляет собой смесь связующего материала,
        воды и специальных добавок. В зависимости от конкретного состава, технологии изготовления, 
        обработки или назначения этого материала различают несколько типов бетона. В основном используются 
        нормальные и легкие бетоны. Легкий бетон, в отличие от нормального, содержит такие добавки как 
        пемза или стиропор (пенополистирол). В качестве связующего в обоих типах бетона применяется цемент. 
        Облегчающие добавки, используемые в легких бетонах, имеют более низкие механические характеристики, 
        по сравнению с гравием, входящим в состав нормального бетона. Как правило, это создает худшие 
        предпосылки для крепления дюбелей в легких бетонах.
        Европейские технические допуски в области ответственного крепления зазличают бетоны с тещинами и без трещин.
    </p>                        
        <h3>1.1.2 Стеновые материалы - полнотелый кирпич сплошной структуры</h3>
        <p>К этой группе кирпичей относятся полнотелый керамический (рядовой, облицовочный, клинкерный) и силикатный кирпичи. 
            При закреплении дюбелей в таком кирпиче, как правило, не возникает никаких проблем, благодаря отсутствию в кирпиче внутренних полостей.</p>
        <h3>1.2. Полнотелый блок пористой структуры</h3>
        <p>
        Полнотелые блоки из легкого или ячеистого (пористого) пенобетона или газобетона имеют в своей структуре большое количество пор, 
        что существенно снижает механические характеристики материала. При креплении в таких блоках рекомендуется использование 
        специальных дюбелей с удлиненной распорной зоной или дюбелей, 
        обеспечивающих связывающее, ненапряженное крепление (см. Механизмы крепления).
        </p>
        <h3>1.3 Пустотелые кирпичи и блоки</h3>
        <h3>1.3.1 Пустотелый кирпич сплошной структуры</h3>
        <p>
        Такой кирпич состоит из непористого материала и содержит внутренние полости, расположенные либо
        параллельно, либо перпендикулярно базовой опорной
        плоскости кирпича. Сечение отверстий, как правило, -
        круглое, овальное или прямоугольное, причем суммарная
        площадь поперечного сечения пустот составляет более
        15% от общей площади опорной плоскости кирпича. К
        этой группе относятся керамические и силикатные
        кирпичи с различными геометриями пустот и пустотелые
        бетонные блоки. Для крепления в таких кирпичах
        применяют специальные типы дюбелей, которые
        заполняют пустоты или проходят насквозь через
        несколько стенок полостей, закрепляясь в них.
        </p>
        <h3>1.3.2 Пустотелый блок пористой структуры</h3>
        <p>
        Несущая способность таких блоков еще ниже из-за
        наличия полостей в пористом материале. Проведение
        крепежных работ требует наиболее тщательного выбора
        типа дюбеля. Предпочтительно использование дюбелей с
        удлиненной распорной зоной или дюбелей, реализующих
        геометрический механизм крепления.
        </p>
        <h3>1.4 Плиты / Листы</h3>
        <p>
        К этой группе относятся тонкостенные строительные
        материалы, имеющие достаточно низкие механические
        характеристики, например гипсокартонные, гипсоволоконные, древесностружечные, асбоцементные,
        цементностружечные листы или МДФпанели. Такие листы
        крепятся либо непосредственно на другую строительную
        основу, или же на некотором расстоянии от нее. При
        креплении предметов к листовым материалам
        необходимо использование специальных дюбелей,
        которые образуют геометрическое крепление на задней
        стенке листов. Такие крепежные элементы, как правило,
        имеют название «дюбель для пустотелых конструкций».
        </p>

    <h3><b>2 Сверление отверстия</b></h3>
    <p>При сверлении следите за тем, чтобы сверло было
        направлено по перпендикуляру к стене, и не используйте
        изношенные или не соответствующие конкретному
        строительному материалу сверла. Просверленное
        отверстие следует очистить и удалить из него остатки
        материала. Следите за соответствием диаметра и
        глубины отверстия рекомендациям изготовителя.
        Для листов и плит не применяйте сверла, предназначенные для сверления твердых строительных материалов.
        Тип и приемы сверления определяются видом
        строительной основы:
    </p>
    <h3>2.1 От отверстия к строительному материалу …</h3>
    <p>Очень часто неизвестно, какой строительный материал
        находится под штукатуркой или обоями. Определить тип
        материала помогает пробное сверление сверлом с
        победитовым наконечником на низких скоростях
        вращения и без ударной нагрузки. По усилию
        сопротивления понятно, идет ли речь о мягком или
        твердом и прочном материале. О конкретном типе
        материала можно судить по цвету и консистенции
        сверлильной муки.
        Бетон: светло-серая или белая мука, мелкая, как пыль, не
        слипающаяся.
        Пенобетон: белая крупнозернистая, но легко размягчающаяся мука.
        Кирпич: красная мука, пустотелый кирпич легко
        определить по ступенчатому проникновению сверла в
        материал; в этом случае нельзя применять ударное
        сверление.
        Силикатный кирпич: белая мука, по ощущениям
        похожая на песок.
        Гипсокартон: белая мелкозернистая пыль, прилипающая к сверлу.
        Гипсоволоконный лист: серая мелкозернистая пыль,
        прилипающая к сверлу
    </p>
        <h3>2.2 ...от строительного материала к методу сверления</h3>
    <p><b>Безударное сверление:</b>
        Сверление отверстий без ударной нагрузки; для мягких,
        пористых строительных материалов с низкой несущей
        способностью, например: пористый бетон, пустотелый
        кирпич, во избежание повреждения перегородок и ребер в
        материале.</p>
        <p><b>Ударное сверление:</b>
        сверление отверстий с большим числом оборотов и
        многочисленными слабыми ударами для строительных
        материалов повышенной прочности, напр. для
        кирпичных кладок из сплошного кирпича.</p>
    <p><b>Сверление с перфоратором:</b>
        Сверление отверстий с малым числом оборотов и
        немногочисленными сильными ударами; для сплошных
        материалов повышенной прочности, например для
        бетона.
        </p>   
        <h3><b>3 Монтаж</b></h3> 
        <p><b>Предварительный монтаж:</b>
        При таком монтаже дюбель полностью утапливается в
        основу, диаметр отверстия в основе больше, чем диаметр
        отверстия в монтируемой детали. Сначала сверлится
        отверстие, затем в него монтируется дюбель, и только
        после этого в дюбель при помощи шурупа крепится
        деталь.</p>

        <p>
            <b>Сквозной монтаж:</b>
            При таком монтаже отверстие в основе сверлится
            насквозь через закрепляемую деталь. Диаметры
            отверстия в основе и детали равны диаметру дюбеля.
            Дюбель монтируется насквозь через закрепляемую
            деталь в отверстие в основе и распирается в нем с
            помощью шурупа. Этот вид монтажа отличается
            наименьшей трудоемкостью и высокой точностью за счет
            соосности отверстий в основе и закрепляемой детали.
        </p>


<!-- /часть2 --> 