<!--row-->
<div class="row" style=" margin-left: 15px;">
                                    <div class="row col-xs-12 col-sm-12 col-md-12" style="background: #fff;
                                                border: 1px solid rgb(221, 221, 221);
                                                box-shadow: 0.5em 0.5em 10px rgba(100,100,100,0.3);
                                                border-radius: 4px;
                                                padding: 15px;
                                                ">
                                        <h4 >Выбор дюбеля под саморез</h4>                                 
                               
                                       
                                            <p class="cont">
                                                После того, как выбор типа самореза и дюбеля для крепления на стене сделан, останется выбрать, воспользовавшись данными, приведенными в таблице ниже типоразмер самореза и соответствующий ему дюбель. 
                                                Определиться с диаметром и глубиной отверстия для установки дюбеля.
                                            </p>       
                                            <p class="cont">
                                                В связи с отсутствием международного стандарта на саморезы и дюбеля, многие производители выпускают по своим внутренним стандартам. Поэтому невозможно точно указать все размеры, 
                                                но в подавляющем числе случаев размеры совпадают с достаточной для практического использования точностью.
                                            </p>                                         
                                            
                                
                                            <div class="row col-xs-12 col-sm-12 col-md-12" > 
                                                <!-- <p><b>Таблица подбора дюбеля для выбранного самореза, размер отверстия для выбранного дюбеля</b> </p>                                                -->
                                                <table class="centered centeredContent table table-striped table-responsive"  cellpadding="2" cellspacing="1">
                                                    <tbody>
                                                    <tr>
                                                    <th colspan="6">Таблица подбора дюбеля для выбранного самореза, размер отверстия для выбранного дюбеля</th>
                                                    </tr>

                                                    <tr>
                                                    <th colspan="2">Саморез</th>
                                                    <th colspan="2">Дюбель</th>
                                                    <th colspan="2">Отверстие под дюбель</th>
                                                    </tr>

                                                    <tr>
                                                    <td class="istyle">Диаметр, мм</td>
                                                    <td class="istyle">Длина, мм</td>
                                                    <td class="istyle">Диаметр, мм</td>
                                                    <td class="istyle">Длина, мм</td>
                                                    <td class="istyle">Диаметр сверла, мм</td>
                                                    <td class="istyle">Глубина сверления, мм</td>
                                                    </tr>

                                                    <tr>
                                                    <td>3</td>
                                                    <td>12, 16, 20, 25, 30, 35, 40</td>
                                                    <td>5</td>
                                                    <td>12, 16, 20, 25, 30, 35, 40</td>
                                                    <td>5</td>
                                                    <td>16, 20, 25, 30, 35, 40, 45</td>
                                                    </tr>

                                                    <tr>
                                                    <td>3,5</td>
                                                    <td>12, 16, 20, 25, 30, 35, 40, 45, 50</td>
                                                    <td>6</td>
                                                    <td>12, 16, 20, 25, 30, 35, 40, 45, 50</td>
                                                    <td>6</td>
                                                    <td>16, 20, 25, 30, 35, 40, 45, 50, 55</td>
                                                    </tr>

                                                    <tr>
                                                    <td>4</td>
                                                    <td>12, 16, 20, 25, 30, 35, 40, 45, 50, 60, 70</td>
                                                    <td>5 или 6</td>
                                                    <td>12, 16, 20, 25, 30, 35, 40, 45, 50, 60, 70</td>
                                                    <td>5 или 6</td>
                                                    <td>16, 20, 25, 30, 35, 40, 45, 50, 55, 65, 75</td>
                                                    </tr>

                                                    <tr>
                                                    <td>4,5</td>
                                                    <td>16, 20, 25, 30, 35, 40, 45, 50, 60, 70, 80</td>
                                                    <td>6 или 8</td>
                                                    <td>16, 20, 25, 30, 35, 40, 45, 50, 60, 70, 80</td>
                                                    <td>6 или 8</td>
                                                    <td>20, 25, 30, 35, 40, 45, 50, 55, 65, 75, 85</td>
                                                    </tr>

                                                    <tr>
                                                    <td>5</td>
                                                    <td>20, 25, 30, 35, 40, 45, 50, 60, 70, 80, 90, 100</td>
                                                    <td>6 или 8</td>
                                                    <td>16, 20, 25, 30, 35, 40, 45, 50, 60, 70, 80, 90, 100</td>
                                                    <td>6 или 8</td>
                                                    <td>20, 25, 30, 35, 40, 45, 50, 55, 65, 75, 85, 95, 105</td>
                                                    </tr>

                                                    <tr>
                                                    <td>6</td>
                                                    <td>40, 45, 50, 60, 70, 80, 90, 100, 120, 140, 160, 180, 200</td>
                                                    <td>8 или 10</td>
                                                    <td>40, 45, 50, 60, 70, 80, 90, 100, 120, 140, 160, 180, 200</td>
                                                    <td>8 или 10</td>
                                                    <td>45, 50, 55, 65, 75, 85, 95, 105, 130, 150, 170, 190, 220</td>
                                                    </tr>

                                                    <tr>
                                                    <td>8</td>
                                                    <td>40, 45, 50, 60, 70, 80, 90, 100, 120, 140, 160, 180, 200</td>
                                                    <td>10 или 12 или 14</td>
                                                    <td>40, 45, 50, 60, 70, 80, 90, 100, 120, 140, 160, 180, 200</td>
                                                    <td>10 или 12 или 14</td>
                                                    <td>45, 50, 55, 65, 75, 85, 95, 105, 130, 150, 170, 190, 220</td>
                                                    </tr>

                                                    <tr>
                                                    <td>10</td>
                                                    <td>40, 45, 50, 60, 70, 80, 90, 100, 120, 140, 160, 180, 200, 220, 240, 260</td>
                                                    <td>12 или 14</td>
                                                    <td>40, 45, 50, 60, 70, 80, 90, 100, 120, 140, 160, 180, 200, 220, 240, 260</td>
                                                    <td>12 или 14</td>
                                                    <td>45, 50, 55, 65, 75, 85, 95, 105, 130, 150, 170, 190, 220, 230, 260, 280</td>
                                                    </tr>

                                                    </tbody>
                                                </table>                                             
                                                
                                            </div>
                                        
                                            <p class="cont">
                                                Пользоваться таблицей нужно следующим образом. Допустим Вам надо повесить книжную полку с максимально возможным весом 100 кг с креплением на двух петлях на кирпичной стене. 
                                                Так как полка будет подвешена на два самореза, то нагрузка на один саморез будет составлять 50 кг. 
                                                Выбираете из таблицы, саморез универсальной резьбой, с полусферической головкой, диаметром 6 мм, длиной не менее 80 мм. Дюбель подойдет стандартный, самый простой.
                                                 Из таблицы видим, такой типоразмер самореза есть, для него подойдет дюбель диаметром 8 или 10 мм длиной 80 мм. 
                                                Так как в наличии есть сверло диаметром 8 мм, то выбираем дюбель тоже диаметром 8 мм. Для его установки нужно просверлить отверстие диаметром 8 мм на глубину 85 мм.
                                            </p>
                                    </div>
                                </div>
                            <!--/row-->